# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [3]:
s1 = pd.Series(np.random.randint(1, 5, 100)) # the last is not include
s2 = pd.Series(np.random.randint(1, 4, 100))
s3 = pd.Series(np.random.randint(10_000, 30_001, 100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [5]:
df = pd.DataFrame([s1, s2, s3]).T

In [6]:
df

    0  1      2
0   2  1  27143
1   4  3  12558
2   3  2  29068
3   1  3  27615
4   1  3  23292
.. .. ..    ...
95  3  3  26539
96  3  3  23151
97  4  2  21093
98  2  3  24458
99  2  1  12248

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [7]:
df.columns = ['bedrs', ' bathrs', 'price_sqr_meter']
df

    bedrs   bathrs  price_sqr_meter
0       2        1            27143
1       4        3            12558
2       3        2            29068
3       1        3            27615
4       1        3            23292
..    ...      ...              ...
95      3        3            26539
96      3        3            23151
97      4        2            21093
98      2        3            24458
99      2        1            12248

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [22]:
bigcolumn = pd.concat([s1, s2, s3], axis=0)
bigcolumn = bigcolumn.to_frame()
bigcolumn
#pd.DataFrame(pd.concat([s1, s2, s3]).reset_index(drop=True), columns=['bigcolumn'])

        0
0       2
1       4
2       3
3       1
4       1
..    ...
95  26539
96  23151
97  21093
98  24458
99  12248

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [23]:
len(bigcolumn)
# As far as we can see, the answer is NO

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [24]:
bigcolumn.reset_index(drop = True)

         0
0        2
1        4
2        3
3        1
4        1
..     ...
295  26539
296  23151
297  21093
298  24458
299  12248

[300 rows x 1 columns]

In [ ]:
# Thank you!